org/Geometry,_Topology,_and_Physics_by_Mikio_Nakahara_in_2003.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Geometry,_Topology,_and_Physics_by_Mikio_Nakahara_in_2003
#+TITLE: Geometry, Topology, and Physics by Mikio Nakahara in 2003
* 1. Quantum Physics
** 1.1 Analytical mechanics
** 1.2 Canonical quantization
** 1.3 Path integral quantization of a Bose particle
** 1.4 Harmonic oscillator
** 1.5 Path integral quantization of a Fermi particle
** 1.6 Quantization of a scalar field
** 1.7 Quantization of a Dirac field
** 1.8 Gauge theories
** 1.9 Magnetic monopoles
** 1.10 Instantons
* 2. Mathematical Preliminaries
* 3. Homology groups
** 3.1 Abelian groups
** 3.2 Simplexes and simplicial complexes
** 3.3 Homology groups of simplicial complexes
** 3.4 General properties of homology groups
* 4. Homotopy groups
** 4.1 Fundamental groups
** 4.2 General properties of fundamental groups
** 4.3 Examples of fundamental groups
** 4.4 Fundamental groups of polyhedra
** 4.5 Higher homotopy groups
** 4.6 General properties of higher homotopy groups
** 4.7 Examples of higher homotopy groups
** 4.8 Orders in condensed matter systems
** 4.9 Defects in nematic liquid crystals
** 4.10 Textures in superfluid 3He-A
* 5. Manifolds
** 5.1 Maniflds
** 5.2 The calculus of manifolds
** 5.3 Flows and Lie derivatives
** 5.4 Differential forms
** 5.5 Integration of differential forms
** 5.6 Lie groups and Lie algebras
** 5.7 The action of Lie groups on manifolds
* 6. de Rham Cohomology Groups
** 6.1 Stokes' theorem
** 6.2 de Rham cohomology groups
** 6.3 Poincare lemma
** 6.4 Structure of de Rham cohomology groups
* 7. Riemannian Geometry
** 7.1 Riemannian manifolds and pseudo-Riemannian manifolds
** 7.2 Parallel transport, connection and covariant derivative
** 7.3 Curvature and torsion
** 7.4 Levi-Civita connections
** 7.5 Holonomy
** 7.6 Isometries and conformal transformations
** 7.7 Killing vector fields and conformal Killing vector fields
** 7.8 Non-coordinate bases
** 7.9 Differential forms and Hodge theory
** 7.10 Aspects of general relativity
** 7.11 Bosonic string theory
* 8. Complex Manifolds
** 8.1 Complex manifolds
** 8.2 Calculus on complex manifolds
** 8.3 Complex differential forms
** 8.4 Hermitian manifolds and Hermitian differential geometry
** 8.5 Kahler manifolds and Kahler differential geometry
** 8.6 Harmonic forms and $$\partial$$-chomology groups
** 8.7 Almost complex manifolds
** 8.8 Orbifolds
* 9. Fibre bundles
** 9.1 Tangent bundles
** 9.2 Fibre bundles
** 9.3 Vector bundles
** 9.4 [[file:principal_bundle.org][principal bundle]]s
* 10. Connections on Fibre bundles
** 10.1 Connections on [[file:principal_bundle.org][principal bundle]]s
** 10.2 Holonomy
** 10.3 Curvature
** 10.4 The covariant derivative on associated vector bundles
** 10.5 Gauge theories
** 10.6 Berry's phase
* 11. Characteristic classes
** 11.1 Invariant polynomials and the Chern-Weil homomorphism
** 11.2 Chern classes
** 11.3 Chern characters
** 11.4 Pontrjagin and Euler classes
** 11.5 Chern-simons forms
** 11.6 Stiefel-Whitney classes
* 12. Index theorems
** 12.1 Elliptic operators and Fredholm operators
** 12.2 The Atiyah-Singer index theorem
** 12.3 The de Rham complex
** 12.4 The Dolbeault complex
** 12.5 The signature complex
** 12.6 Spin complexes
** 12.7 The heat kernel and generalized $$\zeta$$-functions
** 12.8 The Atiyah-Patodi-Singer index theorem
** 12.9 Supersymmetric quantum mechanics
** 12.10 Supersymmetric proof of index theorem
* 13. Anomalies in Gauge Field Theories
** 13.1 Introduction
** 13.2 Abelian anomalies
** 13.3 Non-Abelian anomalies
** 13.4 The Wess-Zumino consistency conditions
** 13.5 Abelian anomalies versus non-Abelian anomalies
** 13.6 The parity anomaly in odd-dimensional spaces
* 14. Bosonic String Theory
** 14.1 Differential geometry on Riemann surfaces
** 14.2 Quantum theory of bosonic strings
** 14.3 One-loop amplitudes
