content/posts/Geometry,_Topology,_and_Physics_by_Mikio_Nakahara_in_2003.md
+++
title = "Geometry, Topology, and Physics by Mikio Nakahara in 2003"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:34-04:00
slug = "Geometry,_Topology,_and_Physics_by_Mikio_Nakahara_in_2003"
draft = false
+++

## 1. Quantum Physics {#1-dot-quantum-physics}


### 1.1 Analytical mechanics {#1-dot-1-analytical-mechanics}


### 1.2 Canonical quantization {#1-dot-2-canonical-quantization}


### 1.3 Path integral quantization of a Bose particle {#1-dot-3-path-integral-quantization-of-a-bose-particle}


### 1.4 Harmonic oscillator {#1-dot-4-harmonic-oscillator}


### 1.5 Path integral quantization of a Fermi particle {#1-dot-5-path-integral-quantization-of-a-fermi-particle}


### 1.6 Quantization of a scalar field {#1-dot-6-quantization-of-a-scalar-field}


### 1.7 Quantization of a Dirac field {#1-dot-7-quantization-of-a-dirac-field}


### 1.8 Gauge theories {#1-dot-8-gauge-theories}


### 1.9 Magnetic monopoles {#1-dot-9-magnetic-monopoles}


### 1.10 Instantons {#1-dot-10-instantons}


## 2. Mathematical Preliminaries {#2-dot-mathematical-preliminaries}


## 3. Homology groups {#3-dot-homology-groups}


### 3.1 Abelian groups {#3-dot-1-abelian-groups}


### 3.2 Simplexes and simplicial complexes {#3-dot-2-simplexes-and-simplicial-complexes}


### 3.3 Homology groups of simplicial complexes {#3-dot-3-homology-groups-of-simplicial-complexes}


### 3.4 General properties of homology groups {#3-dot-4-general-properties-of-homology-groups}


## 4. Homotopy groups {#4-dot-homotopy-groups}


### 4.1 Fundamental groups {#4-dot-1-fundamental-groups}


### 4.2 General properties of fundamental groups {#4-dot-2-general-properties-of-fundamental-groups}


### 4.3 Examples of fundamental groups {#4-dot-3-examples-of-fundamental-groups}


### 4.4 Fundamental groups of polyhedra {#4-dot-4-fundamental-groups-of-polyhedra}


### 4.5 Higher homotopy groups {#4-dot-5-higher-homotopy-groups}


### 4.6 General properties of higher homotopy groups {#4-dot-6-general-properties-of-higher-homotopy-groups}


### 4.7 Examples of higher homotopy groups {#4-dot-7-examples-of-higher-homotopy-groups}


### 4.8 Orders in condensed matter systems {#4-dot-8-orders-in-condensed-matter-systems}


### 4.9 Defects in nematic liquid crystals {#4-dot-9-defects-in-nematic-liquid-crystals}


### 4.10 Textures in superfluid 3He-A {#4-dot-10-textures-in-superfluid-3he-a}


## 5. Manifolds {#5-dot-manifolds}


### 5.1 Maniflds {#5-dot-1-maniflds}


### 5.2 The calculus of manifolds {#5-dot-2-the-calculus-of-manifolds}


### 5.3 Flows and Lie derivatives {#5-dot-3-flows-and-lie-derivatives}


### 5.4 Differential forms {#5-dot-4-differential-forms}


### 5.5 Integration of differential forms {#5-dot-5-integration-of-differential-forms}


### 5.6 Lie groups and Lie algebras {#5-dot-6-lie-groups-and-lie-algebras}


### 5.7 The action of Lie groups on manifolds {#5-dot-7-the-action-of-lie-groups-on-manifolds}


## 6. de Rham Cohomology Groups {#6-dot-de-rham-cohomology-groups}


### 6.1 Stokes' theorem {#6-dot-1-stokes-theorem}


### 6.2 de Rham cohomology groups {#6-dot-2-de-rham-cohomology-groups}


### 6.3 Poincare lemma {#6-dot-3-poincare-lemma}


### 6.4 Structure of de Rham cohomology groups {#6-dot-4-structure-of-de-rham-cohomology-groups}


## 7. Riemannian Geometry {#7-dot-riemannian-geometry}


### 7.1 Riemannian manifolds and pseudo-Riemannian manifolds {#7-dot-1-riemannian-manifolds-and-pseudo-riemannian-manifolds}


### 7.2 Parallel transport, connection and covariant derivative {#7-dot-2-parallel-transport-connection-and-covariant-derivative}


### 7.3 Curvature and torsion {#7-dot-3-curvature-and-torsion}


### 7.4 Levi-Civita connections {#7-dot-4-levi-civita-connections}


### 7.5 Holonomy {#7-dot-5-holonomy}


### 7.6 Isometries and conformal transformations {#7-dot-6-isometries-and-conformal-transformations}


### 7.7 Killing vector fields and conformal Killing vector fields {#7-dot-7-killing-vector-fields-and-conformal-killing-vector-fields}


### 7.8 Non-coordinate bases {#7-dot-8-non-coordinate-bases}


### 7.9 Differential forms and Hodge theory {#7-dot-9-differential-forms-and-hodge-theory}


### 7.10 Aspects of general relativity {#7-dot-10-aspects-of-general-relativity}


### 7.11 Bosonic string theory {#7-dot-11-bosonic-string-theory}


## 8. Complex Manifolds {#8-dot-complex-manifolds}


### 8.1 Complex manifolds {#8-dot-1-complex-manifolds}


### 8.2 Calculus on complex manifolds {#8-dot-2-calculus-on-complex-manifolds}


### 8.3 Complex differential forms {#8-dot-3-complex-differential-forms}


### 8.4 Hermitian manifolds and Hermitian differential geometry {#8-dot-4-hermitian-manifolds-and-hermitian-differential-geometry}


### 8.5 Kahler manifolds and Kahler differential geometry {#8-dot-5-kahler-manifolds-and-kahler-differential-geometry}


### 8.6 Harmonic forms and \\[\partial\\]-chomology groups {#8-dot-6-harmonic-forms-and-partial-chomology-groups}


### 8.7 Almost complex manifolds {#8-dot-7-almost-complex-manifolds}


### 8.8 Orbifolds {#8-dot-8-orbifolds}


## 9. Fibre bundles {#9-dot-fibre-bundles}


### 9.1 Tangent bundles {#9-dot-1-tangent-bundles}


### 9.2 Fibre bundles {#9-dot-2-fibre-bundles}


### 9.3 Vector bundles {#9-dot-3-vector-bundles}


### 9.4 [principal bundle]({{< relref "principal_bundle" >}})s {#9-dot-4-principal-bundle--principal-bundle-dot-md--s}


## 10. Connections on Fibre bundles {#10-dot-connections-on-fibre-bundles}


### 10.1 Connections on [principal bundle]({{< relref "principal_bundle" >}})s {#10-dot-1-connections-on-principal-bundle--principal-bundle-dot-md--s}


### 10.2 Holonomy {#10-dot-2-holonomy}


### 10.3 Curvature {#10-dot-3-curvature}


### 10.4 The covariant derivative on associated vector bundles {#10-dot-4-the-covariant-derivative-on-associated-vector-bundles}


### 10.5 Gauge theories {#10-dot-5-gauge-theories}


### 10.6 Berry's phase {#10-dot-6-berry-s-phase}


## 11. Characteristic classes {#11-dot-characteristic-classes}


### 11.1 Invariant polynomials and the Chern-Weil homomorphism {#11-dot-1-invariant-polynomials-and-the-chern-weil-homomorphism}


### 11.2 Chern classes {#11-dot-2-chern-classes}


### 11.3 Chern characters {#11-dot-3-chern-characters}


### 11.4 Pontrjagin and Euler classes {#11-dot-4-pontrjagin-and-euler-classes}


### 11.5 Chern-simons forms {#11-dot-5-chern-simons-forms}


### 11.6 Stiefel-Whitney classes {#11-dot-6-stiefel-whitney-classes}


## 12. Index theorems {#12-dot-index-theorems}


### 12.1 Elliptic operators and Fredholm operators {#12-dot-1-elliptic-operators-and-fredholm-operators}


### 12.2 The Atiyah-Singer index theorem {#12-dot-2-the-atiyah-singer-index-theorem}


### 12.3 The de Rham complex {#12-dot-3-the-de-rham-complex}


### 12.4 The Dolbeault complex {#12-dot-4-the-dolbeault-complex}


### 12.5 The signature complex {#12-dot-5-the-signature-complex}


### 12.6 Spin complexes {#12-dot-6-spin-complexes}


### 12.7 The heat kernel and generalized \\[\zeta\\]-functions {#12-dot-7-the-heat-kernel-and-generalized-zeta-functions}


### 12.8 The Atiyah-Patodi-Singer index theorem {#12-dot-8-the-atiyah-patodi-singer-index-theorem}


### 12.9 Supersymmetric quantum mechanics {#12-dot-9-supersymmetric-quantum-mechanics}


### 12.10 Supersymmetric proof of index theorem {#12-dot-10-supersymmetric-proof-of-index-theorem}


## 13. Anomalies in Gauge Field Theories {#13-dot-anomalies-in-gauge-field-theories}


### 13.1 Introduction {#13-dot-1-introduction}


### 13.2 Abelian anomalies {#13-dot-2-abelian-anomalies}


### 13.3 Non-Abelian anomalies {#13-dot-3-non-abelian-anomalies}


### 13.4 The Wess-Zumino consistency conditions {#13-dot-4-the-wess-zumino-consistency-conditions}


### 13.5 Abelian anomalies versus non-Abelian anomalies {#13-dot-5-abelian-anomalies-versus-non-abelian-anomalies}


### 13.6 The parity anomaly in odd-dimensional spaces {#13-dot-6-the-parity-anomaly-in-odd-dimensional-spaces}


## 14. Bosonic String Theory {#14-dot-bosonic-string-theory}


### 14.1 Differential geometry on Riemann surfaces {#14-dot-1-differential-geometry-on-riemann-surfaces}


### 14.2 Quantum theory of bosonic strings {#14-dot-2-quantum-theory-of-bosonic-strings}


### 14.3 One-loop amplitudes {#14-dot-3-one-loop-amplitudes}
